benchmark_result/bench_result_hadware_evol/fio/xen_4_10_4_mba/vm2/fio_result/round2/rand_read_throughput
rand_read_throughput: (g=0): rw=randread, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=64
...
fio-3.1
Starting 4 processes

rand_read_throughput: (groupid=0, jobs=4): err= 0: pid=17062: Thu Jun 13 07:11:40 2024
   read: IOPS=2103, BW=2108MiB/s (2210MB/s)(124GiB/60013msec)
    slat (usec): min=82, max=36140, avg=1626.40, stdev=3081.94
    clat (usec): min=1220, max=543423, avg=119817.38, stdev=61163.92
     lat (msec): min=4, max=550, avg=121.49, stdev=61.75
    clat percentiles (msec):
     |  1.00th=[   35],  5.00th=[   38], 10.00th=[   48], 20.00th=[   68],
     | 30.00th=[   85], 40.00th=[  101], 50.00th=[  113], 60.00th=[  126],
     | 70.00th=[  140], 80.00th=[  161], 90.00th=[  199], 95.00th=[  234],
     | 99.00th=[  321], 99.50th=[  359], 99.90th=[  414], 99.95th=[  451],
     | 99.99th=[  527]
   bw (  KiB/s): min=121806, max=1639631, per=25.02%, avg=540130.88, stdev=210534.48, samples=480
   iops        : min=  118, max= 1601, avg=527.16, stdev=205.59, samples=480
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.03%, 50=11.33%
  lat (msec)   : 100=28.58%, 250=56.54%, 500=3.67%, 750=0.03%
  cpu          : usr=6.81%, sys=37.21%, ctx=69523, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=103.2%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwt: total=126243,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=2108MiB/s (2210MB/s), 2108MiB/s-2108MiB/s (2210MB/s-2210MB/s), io=124GiB (133GB), run=60013-60013msec

Disk stats (read/write):
  xvda: ios=1044273/10, merge=0/11, ticks=1472948/16, in_queue=1392600, util=99.08%